<h1>Book Recommendation Engine using KNN ML</h1>

In [45]:
# import libraries (you may add additional imports but you may not have to)

import numpy as np
import pandas as pd
from scipy.sparse import csr_matrix
from sklearn.neighbors import NearestNeighbors
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.preprocessing import MinMaxScaler
from scipy.sparse import hstack
import matplotlib.pyplot as plt

In [1]:
# get data files

!wget https://cdn.freecodecamp.org/project-data/books/book-crossings.zip

!unzip book-crossings.zip

books_filename = 'BX-Books.csv'
ratings_filename = 'BX-Book-Ratings.csv'

--2024-03-22 20:10:57--  https://cdn.freecodecamp.org/project-data/books/book-crossings.zip
Resolving cdn.freecodecamp.org (cdn.freecodecamp.org)... 104.26.2.33, 172.67.70.149, 104.26.3.33, ...
Connecting to cdn.freecodecamp.org (cdn.freecodecamp.org)|104.26.2.33|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 26085508 (25M) [application/zip]
Saving to: ‘book-crossings.zip’

book-crossings.zip  100%[===================>]  24,88M  21,7MB/s    in 1,1s

2024-03-22 20:10:59 (21,7 MB/s) - ‘book-crossings.zip’ saved [26085508/26085508]

Archive:  book-crossings.zip
  inflating: BX-Book-Ratings.csv
  inflating: BX-Books.csv
  inflating: BX-Users.csv

In [10]:
# import csv data into dataframes

df_books = pd.read_csv(
    books_filename,
    encoding = "ISO-8859-1",
    sep=";",
    header=0,
    names=['isbn', 'title', 'author'],
    usecols=['isbn', 'title', 'author'],
    dtype={'isbn': 'str', 'title': 'str', 'author': 'str'})

df_ratings = pd.read_csv(
    ratings_filename,
    encoding = "ISO-8859-1",
    sep=";",
    header=0,
    names=['user', 'isbn', 'rating'],
    usecols=['user', 'isbn', 'rating'],
    dtype={'user': 'int32', 'isbn': 'str', 'rating': 'float32'})

In [11]:
# show books dataframe

df_books.head()

,isbn,title,author
0,0195153448,Classical Mythology,Mark P. O. Morford
1,0002005018,Clara Callan,Richard Bruce Wright
2,0060973129,Decision in Normandy,Carlo D'Este
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata
4,0393045218,The Mummies of Urumchi,E. J. W. Barber

In [16]:
# show ratings dataframe

df_ratings.sample(5)

          user        isbn  rating
539250  129563  0525450602     0.0
789492  190925  0340394425     0.0
106977   24585  0879519274     6.0
838155  202885  0553136518     7.0
944500  228880  0590112899     0.0

In [26]:
# add your code here - consider creating a new cell for each section of code

# 1) Clean the data

# first, for the books
nan_count_books = df_books.isna().sum()

print(nan_count_books)

isbn      0
title     0
author    2
dtype: int64

In [27]:
# see those books with no author

filt = df_books['author'].isna()
df_books[filt]

              isbn                                              title author
118038  0751352497                           A+ Quiz Masters:01 Earth    NaN
187700  9627982032  The Credit Suisse Guide to Managing Your Perso...    NaN

In [29]:
# remove them

df_books.dropna(inplace = True)

nan_count_books = df_books.isna().sum()

print(nan_count_books)

isbn      0
title     0
author    0
dtype: int64

In [30]:
# second, for the ratings (no NaN values here)

nan_count_ratings = df_ratings.isna().sum()

print(nan_count_ratings)

user      0
isbn      0
rating    0
dtype: int64

In [133]:
# combine the title, author and user rating features into one single dataframe

new_df_books = pd.merge(df_books, df_ratings, on = "isbn")
new_df_books.drop(columns = ['isbn'], inplace = True)
new_df_books.head()

                 title                author   user  rating
0  Classical Mythology    Mark P. O. Morford      2     0.0
1         Clara Callan  Richard Bruce Wright      8     5.0
2         Clara Callan  Richard Bruce Wright  11400     0.0
3         Clara Callan  Richard Bruce Wright  11676     8.0
4         Clara Callan  Richard Bruce Wright  41385     0.0

In [164]:
# third, drop duplicates
new_df_books.sample(5)

,title,author,user,rating
967000,Reckless (The First Amanda Roberts Mystery),Sherryl Woods,127233,0.0
86763,Flesh and Blood,Jonathan Kellerman,260944,7.0
661638,A Garden in the Rain,Lynn Kurland,153662,10.0
676690,Book,Whoopi Goldberg,93085,9.0
256426,Wlt: A Radio Romance,Garrison Keillor,19571,4.0

In [182]:
# function to return recommended books - this will be tested
def get_recommends(book = ""):


  return recommended_books

In [183]:
books = get_recommends("Where the Heart Is (Oprah's Book Club (Paperback))")
print(books)

def test_book_recommendation():
  test_pass = True
  recommends = get_recommends("Where the Heart Is (Oprah's Book Club (Paperback))")
  if recommends[0] != "Where the Heart Is (Oprah's Book Club (Paperback))":
    test_pass = False
  recommended_books = ["I'll Be Seeing You", 'The Weight of Water', 'The Surgeon', 'I Know This Much Is True']
  recommended_books_dist = [0.8, 0.77, 0.77, 0.77]
  for i in range(2): 
    if recommends[1][i][0] not in recommended_books:
      test_pass = False
    if abs(recommends[1][i][1] - recommended_books_dist[i]) >= 0.05:
      test_pass = False
  if test_pass:
    print("You passed the challenge! 🎉🎉🎉🎉🎉")
  else:
    print("You haven't passed yet. Keep trying!")

test_book_recommendation()

NameError: name 'recommended_books' is not defined